Israr-Engineering/PMM-06XX-IO-GENERAL/custom_Board/1.8.13/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# PMM0606 (ESI High Speed Data Logger)
# --------------------------------------
PMM0606.name=PMM0606 (ESI High Speed Data Logger)
PMM0606.vid.0=0x2341
PMM0606.pid.0=0x804d
PMM0606.vid.1=0x2341
PMM0606.pid.1=0x004d
PMM0606.vid.2=0x2341
PMM0606.pid.2=0x824d
PMM0606.vid.3=0x2341
PMM0606.pid.3=0x024d
PMM0606.upload_port.0.vid=0x2341
PMM0606.upload_port.0.pid=0x804d
PMM0606.upload_port.1.vid=0x2341
PMM0606.upload_port.1.pid=0x004d
PMM0606.upload_port.2.vid=0x2341
PMM0606.upload_port.2.pid=0x824d
PMM0606.upload_port.3.vid=0x2341
PMM0606.upload_port.3.pid=0x024d
PMM0606.upload_port.4.board=arduino_zero_native
PMM0606.build.usb_product="PMM0606"
PMM0606.upload.tool=bossac
PMM0606.upload.tool.default=bossac
PMM0606.upload.tool.network=arduino_ota
PMM0606.upload.protocol=sam-ba
PMM0606.upload.maximum_size=262144
PMM0606.upload.maximum_data_size=32768
PMM0606.upload.use_1200bps_touch=true
PMM0606.upload.wait_for_upload_port=true
PMM0606.upload.native_usb=true
PMM0606.build.mcu=cortex-m0plus
PMM0606.build.f_cpu=48000000L
PMM0606.build.usb_product="pmm0606"
PMM0606.build.usb_manufacturer="PMM LLC"
PMM0606.build.board=pmm0606
PMM0606.build.core=arduino
PMM0606.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0606.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0606.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0606.build.variant=pmm0606
PMM0606.build.variant_system_lib=
PMM0606.build.vid=0x2341
PMM0606.build.pid=0x804d
PMM0606.bootloader.tool=openocd
PMM0606.bootloader.tool.default=openocd
PMM0606.bootloader.file=zero/samd21_sam_ba.bin


# pmm0620 (ESI 12x Digital Inputs)
# --------------------------------------
pmm0620.name=pmm0620(ESI 12x Digital Inputs)
pmm0620.vid.0=0x2341
pmm0620.pid.0=0x804d
pmm0620.vid.1=0x2341
pmm0620.pid.1=0x004d
pmm0620.vid.2=0x2341
pmm0620.pid.2=0x824d
pmm0620.vid.3=0x2341
pmm0620.pid.3=0x024d
pmm0620.upload_port.0.vid=0x2341
pmm0620.upload_port.0.pid=0x804d
pmm0620.upload_port.1.vid=0x2341
pmm0620.upload_port.1.pid=0x004d
pmm0620.upload_port.2.vid=0x2341
pmm0620.upload_port.2.pid=0x824d
pmm0620.upload_port.3.vid=0x2341
pmm0620.upload_port.3.pid=0x024d
pmm0620.upload_port.4.board=pmm0620

pmm0620.upload.tool=bossac
pmm0620.upload.tool.default=bossac
pmm0620.upload.tool.network=arduino_ota
pmm0620.upload.protocol=sam-ba
pmm0620.upload.maximum_size=262144
pmm0620.upload.maximum_data_size=32768
pmm0620.upload.use_1200bps_touch=true
pmm0620.upload.wait_for_upload_port=true
pmm0620.upload.native_usb=true
pmm0620.build.mcu=cortex-m0plus
pmm0620.build.f_cpu=48000000L
pmm0620.build.usb_product="PMM0620"
pmm0620.build.usb_manufacturer="PMM LLC"
pmm0620.build.board=SAMD_ZERO
pmm0620.build.core=arduino
pmm0620.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
pmm0620.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
pmm0620.build.openocdscript=openocd_scripts/pmm0620.cfg
pmm0620.build.variant=pmm0620
pmm0620.build.variant_system_lib=
pmm0620.build.vid=0x2341
pmm0620.build.pid=0x804d
pmm0620.bootloader.tool=openocd
pmm0620.bootloader.tool.default=openocd
pmm0620.bootloader.file=zero/samd21_sam_ba.bin


# PMM0625 ( ESI SET 8x Digital Output)
# --------------------------------------
PMM0625.name=PMM0625 ( ESI SET 8x Digital Output)
PMM0625.vid.0=0x2341
PMM0625.pid.0=0x804d
PMM0625.vid.1=0x2341
PMM0625.pid.1=0x004d
PMM0625.vid.2=0x2341
PMM0625.pid.2=0x824d
PMM0625.vid.3=0x2341
PMM0625.pid.3=0x024d
PMM0625.upload_port.0.vid=0x2341
PMM0625.upload_port.0.pid=0x804d
PMM0625.upload_port.1.vid=0x2341
PMM0625.upload_port.1.pid=0x004d
PMM0625.upload_port.2.vid=0x2341
PMM0625.upload_port.2.pid=0x824d
PMM0625.upload_port.3.vid=0x2341
PMM0625.upload_port.3.pid=0x024d
PMM0625.upload_port.4.board=arduino_zero_native
PMM0625.build.usb_product="PMM0625"
PMM0625.upload.tool=bossac
PMM0625.upload.tool.default=bossac
PMM0625.upload.tool.network=arduino_ota
PMM0625.upload.protocol=sam-ba
PMM0625.upload.maximum_size=262144
PMM0625.upload.maximum_data_size=32768
PMM0625.upload.use_1200bps_touch=true
PMM0625.upload.wait_for_upload_port=true
PMM0625.upload.native_usb=true
PMM0625.build.mcu=cortex-m0plus
PMM0625.build.f_cpu=48000000L
PMM0625.build.usb_product="pmm0625"
PMM0625.build.usb_manufacturer="PMM LLC"
PMM0625.build.board=pmm0625
PMM0625.build.core=arduino
PMM0625.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0625.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0625.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0625.build.variant=pmm0625
PMM0625.build.variant_system_lib=
PMM0625.build.vid=0x2341
PMM0625.build.pid=0x804d
PMM0625.bootloader.tool=openocd
PMM0625.bootloader.tool.default=openocd
PMM0625.bootloader.file=zero/samd21_sam_ba.bin

# PMM0626 (ESI SER 8x Digital Output)
# --------------------------------------
PMM0626.name=PMM0626 (ESI SER 8x Digital Output)
PMM0626.vid.0=0x2341
PMM0626.pid.0=0x804d
PMM0626.vid.1=0x2341
PMM0626.pid.1=0x004d
PMM0626.vid.2=0x2341
PMM0626.pid.2=0x824d
PMM0626.vid.3=0x2341
PMM0626.pid.3=0x024d
PMM0626.upload_port.0.vid=0x2341
PMM0626.upload_port.0.pid=0x804d
PMM0626.upload_port.1.vid=0x2341
PMM0626.upload_port.1.pid=0x004d
PMM0626.upload_port.2.vid=0x2341
PMM0626.upload_port.2.pid=0x824d
PMM0626.upload_port.3.vid=0x2341
PMM0626.upload_port.3.pid=0x024d
PMM0626.upload_port.4.board=arduino_zero_native
PMM0626.build.usb_product="PMM0626"
PMM0626.upload.tool=bossac
PMM0626.upload.tool.default=bossac
PMM0626.upload.tool.network=arduino_ota
PMM0626.upload.protocol=sam-ba
PMM0626.upload.maximum_size=262144
PMM0626.upload.maximum_data_size=32768
PMM0626.upload.use_1200bps_touch=true
PMM0626.upload.wait_for_upload_port=true
PMM0626.upload.native_usb=true
PMM0626.build.mcu=cortex-m0plus
PMM0626.build.f_cpu=48000000L
PMM0626.build.usb_product="pmm0626"
PMM0626.build.usb_manufacturer="PMM LLC"
PMM0626.build.board=pmm0626
PMM0626.build.core=arduino
PMM0626.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0626.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0626.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0626.build.variant=pmm0626
PMM0626.build.variant_system_lib=
PMM0626.build.vid=0x2341
PMM0626.build.pid=0x804d
PMM0626.bootloader.tool=openocd
PMM0626.bootloader.tool.default=openocd
PMM0626.bootloader.file=zero/samd21_sam_ba.bin


# PMM0627 ( ESI SEAC 8x Digital Output)
# --------------------------------------
PMM0627.name=PMM0627 ( ESI SEAC 8x Digital Output)
PMM0627.vid.0=0x2341
PMM0627.pid.0=0x804d
PMM0627.vid.1=0x2341
PMM0627.pid.1=0x004d
PMM0627.vid.2=0x2341
PMM0627.pid.2=0x824d
PMM0627.vid.3=0x2341
PMM0627.pid.3=0x024d
PMM0627.upload_port.0.vid=0x2341
PMM0627.upload_port.0.pid=0x804d
PMM0627.upload_port.1.vid=0x2341
PMM0627.upload_port.1.pid=0x004d
PMM0627.upload_port.2.vid=0x2341
PMM0627.upload_port.2.pid=0x824d
PMM0627.upload_port.3.vid=0x2341
PMM0627.upload_port.3.pid=0x024d
PMM0627.upload_port.4.board=arduino_zero_native
PMM0627.build.usb_product="PMM0627"
PMM0627.upload.tool=bossac
PMM0627.upload.tool.default=bossac
PMM0627.upload.tool.network=arduino_ota
PMM0627.upload.protocol=sam-ba
PMM0627.upload.maximum_size=262144
PMM0627.upload.maximum_data_size=32768
PMM0627.upload.use_1200bps_touch=true
PMM0627.upload.wait_for_upload_port=true
PMM0627.upload.native_usb=true
PMM0627.build.mcu=cortex-m0plus
PMM0627.build.f_cpu=48000000L
PMM0627.build.usb_product="pmm0627"
PMM0627.build.usb_manufacturer="PMM LLC"
PMM0627.build.board=pmm0627
PMM0627.build.core=arduino
PMM0627.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0627.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0627.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0627.build.variant=pmm0627
PMM0627.build.variant_system_lib=
PMM0627.build.vid=0x2341
PMM0627.build.pid=0x804d
PMM0627.bootloader.tool=openocd
PMM0627.bootloader.tool.default=openocd
PMM0627.bootloader.file=zero/samd21_sam_ba.bin

# PMM0628R (ESI 8x Inputs 4x Relay Outputs)
# --------------------------------------
PMM0628R.name=PMM0628R (ESI 8x Inputs 4x Relay Outputs)
PMM0628R.vid.0=0x2341
PMM0628R.pid.0=0x804d
PMM0628R.vid.1=0x2341
PMM0628R.pid.1=0x004d
PMM0628R.vid.2=0x2341
PMM0628R.pid.2=0x824d
PMM0628R.vid.3=0x2341
PMM0628R.pid.3=0x024d
PMM0628R.upload_port.0.vid=0x2341
PMM0628R.upload_port.0.pid=0x804d
PMM0628R.upload_port.1.vid=0x2341
PMM0628R.upload_port.1.pid=0x004d
PMM0628R.upload_port.2.vid=0x2341
PMM0628R.upload_port.2.pid=0x824d
PMM0628R.upload_port.3.vid=0x2341
PMM0628R.upload_port.3.pid=0x024d
PMM0628R.upload_port.4.board=arduino_zero_native
PMM0628R.build.usb_product="PMM0628R"
PMM0628R.upload.tool=bossac
PMM0628R.upload.tool.default=bossac
PMM0628R.upload.tool.network=arduino_ota
PMM0628R.upload.protocol=sam-ba
PMM0628R.upload.maximum_size=262144
PMM0628R.upload.maximum_data_size=32768
PMM0628R.upload.use_1200bps_touch=true
PMM0628R.upload.wait_for_upload_port=true
PMM0628R.upload.native_usb=true
PMM0628R.build.mcu=cortex-m0plus
PMM0628R.build.f_cpu=48000000L
PMM0628R.build.usb_product="pmm0628R"
PMM0628R.build.usb_manufacturer="PMM LLC"
PMM0628R.build.board=pmm0628R
PMM0628R.build.core=arduino
PMM0628R.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628R.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628R.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628R.build.variant=pmm0628R
PMM0628R.build.variant_system_lib=
PMM0628R.build.vid=0x2341
PMM0628R.build.pid=0x804d
PMM0628R.bootloader.tool=openocd
PMM0628R.bootloader.tool.default=openocd
PMM0628R.bootloader.file=zero/samd21_sam_ba.bin


# PMM0628T ( ESI 8x Inputs 4x Transistor Outputs)
# --------------------------------------
PMM0628T.name=PMM0628T ( ESI 8x Inputs 4x Transistor Outputs)
PMM0628T.vid.0=0x2341
PMM0628T.pid.0=0x804d
PMM0628T.vid.1=0x2341
PMM0628T.pid.1=0x004d
PMM0628T.vid.2=0x2341
PMM0628T.pid.2=0x824d
PMM0628T.vid.3=0x2341
PMM0628T.pid.3=0x024d
PMM0628T.upload_port.0.vid=0x2341
PMM0628T.upload_port.0.pid=0x804d
PMM0628T.upload_port.1.vid=0x2341
PMM0628T.upload_port.1.pid=0x004d
PMM0628T.upload_port.2.vid=0x2341
PMM0628T.upload_port.2.pid=0x824d
PMM0628T.upload_port.3.vid=0x2341
PMM0628T.upload_port.3.pid=0x024d
PMM0628T.upload_port.4.board=arduino_zero_native
PMM0628T.build.usb_product="PMM0628T"
PMM0628T.upload.tool=bossac
PMM0628T.upload.tool.default=bossac
PMM0628T.upload.tool.network=arduino_ota
PMM0628T.upload.protocol=sam-ba
PMM0628T.upload.maximum_size=262144
PMM0628T.upload.maximum_data_size=32768
PMM0628T.upload.use_1200bps_touch=true
PMM0628T.upload.wait_for_upload_port=true
PMM0628T.upload.native_usb=true
PMM0628T.build.mcu=cortex-m0plus
PMM0628T.build.f_cpu=48000000L
PMM0628T.build.usb_product="pmm0628T"
PMM0628T.build.usb_manufacturer="PMM LLC"
PMM0628T.build.board=pmm0628T
PMM0628T.build.core=arduino
PMM0628T.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628T.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628T.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628T.build.variant=pmm0628T
PMM0628T.build.variant_system_lib=
PMM0628T.build.vid=0x2341
PMM0628T.build.pid=0x804d
PMM0628T.bootloader.tool=openocd
PMM0628T.bootloader.tool.default=openocd
PMM0628T.bootloader.file=zero/samd21_sam_ba.bin


